from nctp.ncg2pk.utils import JA_LIST, MO_LIST, \
                              LE_MORPHEME, FUNC_MORPHEME
from collections import OrderedDict

add_nieun_dict = OrderedDict({
    "rule_29" : [
        # # 형태소 분석 이슈로 임시 제외(2021.07.27)
        # {
        #     "condition": {
        #         "L": {"jong" : list(set(JA_LIST) - set(["ㄹ"])), "before_space" : True},
        #         "R" : {"cho" : ["ㅇ"], "joong" : ["ㅣ", "ㅑ", "ㅛ", "ㅕ", "ㅠ"], "tag" : LE_MORPHEME}
        #     },
        #     "process": {
        #         "L": {"jong" : []},
        #         "R": {"cho" : ["ㄴ"]}
        #     }
        # },
        {
            "condition": {
                "L": {"jong" : ["ㄹ"], "before_space" : True},
                "R" : {"cho" : ["ㅇ"], "joong" : ["ㅣ", "ㅑ", "ㅛ", "ㅕ", "ㅠ"], "tag" : LE_MORPHEME}
            },
            "process": {
                "L": {"jong" : []},
                "R": {"cho" : ["ㄹ"]}
            }
        }
    ]
})

yooeum_nieun_dict = OrderedDict({
    "rule_20" : [
        {
            "condition": {
                "L": {"jong": ["ㄹ", "ㅀ", "ㄾ"]},
                "R": {"cho": ["ㄴ"]}
            },
            "process": {
                "L": {"jong": ["ㄹ", "ㅀ", "ㄾ"]},
                "R": {"cho" : ["ㄹ", "ㄹ", "ㄹ"]}
                     }
        },
        {
            "condition": {
                "L": {"jong": ["ㄴ"]},
                "R": {"cho": ["ㄹ"]}
            },
            "process": {
                "L": {"jong": ["ㄹ"]},
                "R": {"cho": ["ㄹ"]}
            }
        }
    ]
})

doinsori_dict = OrderedDict({
    "rule_23" : [
        {
            "condition": {
                "L": {"jong": ["ㄱ", "ㄲ", "ㅋ", "ㄳ", "ㄺ", "ㄷ",
                               "ㅅ", "ㅆ", "ㅈ", "ㅊ", "ㅌ",
                               "ㅂ", "ㅍ", "ㄼ", "ㄿ", "ㅄ"]},
                "R": {"cho": ["ㄱ", "ㄷ", "ㅂ", "ㅅ", "ㅈ"]}
            },
            "process": {
                "L": {"jong": ["ㄱ", "ㄲ", "ㅋ", "ㄳ", "ㄺ", "ㄷ",
                               "ㅅ", "ㅆ", "ㅈ", "ㅊ", "ㅌ",
                               "ㅂ", "ㅍ", "ㄼ", "ㄿ", "ㅄ"]},
                "R": {"cho": ["ㄲ", "ㄸ", "ㅃ", "ㅆ", "ㅉ"]}
            }
        }
    ],
    "rule_24" : [
        {
            "condition": {
                "L" : {"jong": ["ㄴ", "ㄵ", "ㅁ", "ㄻ"], "tag": ["VV", "VA"], "first_tag": True},
                "R" : {"cho": ["ㄱ", "ㄷ", "ㅂ", "ㅅ", "ㅈ"], "tag": ["E"], "first_tag": True},
            },
            "process": {
                "L" : {"jong": ["ㄴ", "ㄵ", "ㅁ", "ㄻ"]},
                "R" : {"cho": ["ㄲ", "ㄸ", "ㅃ", "ㅆ", "ㅉ"]}
            }
        }
    ],
    "rule_25" : [
        {
            "condition": {
                "L": {"jong": ["ㄾ", "ㄼ"], "tag": ["VV", "VA"], "first_tag": True},
                "R": {"cho" : ["ㄱ", "ㄷ", "ㅂ", "ㅅ", "ㅈ"], "tag": ["E"], "first_tag": True},
            },
            "process": {
                "L": {"jong": ["ㄾ", "ㄼ"]},
                "R": {"cho": ["ㄲ", "ㄸ", "ㅃ", "ㅆ", "ㅉ"]}
            }
        }
    ],
    "rule_27" : [
        {
            "condition": {
                "L": {"jong": ["ㄹ"], "tag": ["E"]},
                "R": {"cho": ["ㄱ", "ㄷ", "ㅂ", "ㅅ", "ㅈ"]}
            },
            "process": {
                "L": {"jong" : ["ㄹ"]},
                "R": {"cho": ["ㄲ", "ㄸ", "ㅃ", "ㅆ", "ㅉ"]}
            }
        }
    ]
})

jongseong_dict = OrderedDict({
    "rule_11" : [
        {
            "condition": {
                "L" : {"jong" : ["ㄺ"], "tag": ["VV", "VA"]}, # 어간
                "R" : {"cho" : ["ㄲ"], "tag" : ["E"]},  # 어미, 원래는 ㄲ이 아닌 ㄱ이지만 초성의된소리화에서 ㄱ->ㄲ이 되므로
            },
            "process": {
                "L" : {"jong" : ["ㄹ"]},
                "R" : {"cho" : ["ㄲ"]}
            }
        }
    ],
    "rule_17" : [
        {
            "condition": {
                "L" : {
                    "jong": ["ㄷ"]
                },
                "R" : {
                    "cho" : ["ㅎ"],
                    "joong" : ["ㅣ", "ㅑ", "ㅕ", "ㅛ", "ㅠ"]
                },
            },
            "process" : {
                "L" : {
                    "jong" : [0]
                },
                "R" : {
                    "cho" : ["ㅊ"],
                    "joong" : ["ㅣ", "ㅑ", "ㅕ", "ㅛ", "ㅠ"]
                }
            }
        }
    ],
    "rule_10_a" : [
        {
            "condition": {
                "L" : {"cho": ["ㅂ"], "joong": ["ㅏ"], "jong": ["ㄼ"]},
                "R" : {"cho": list(set(JA_LIST) - set(["ㅎ", "ㅇ"]))}
            },
            "process" : {
                "L" : {"jong": ["ㅂ"]},
                "R" : {"cho" : []}
            }
        }
    ],
    "rule_9_10_11" : [
        {
            "condition": {
                "L": {"jong": ["ㄲ", "ㅋ", "ㄳ", "ㄺ",
                                "ㅅ", "ㅆ", "ㅈ", "ㅊ", "ㅌ",
                                "ㅍ", "ㅄ", "ㄿ",
                                "ㄵ",
                                "ㄼ", "ㄽ", "ㄾ",
                                "ㄻ"]},
                "R": {"cho": list(set(JA_LIST) - set(["ㅎ", "ㅇ"]))}
            },
            "process": {
                "L" : {
                    "jong": ["ㄱ", "ㄱ", "ㄱ", "ㄱ",
                             "ㄷ", "ㄷ", "ㄷ", "ㄷ", "ㄷ",
                             "ㅂ", "ㅂ", "ㅂ",
                             "ㄴ",
                             "ㄹ", "ㄹ", "ㄹ",
                             "ㅁ"]
                },
                "R":{
                    "cho" : []
                }
            }
        }
    ],
    "rule_17_2" : [
        {
            "condition": {
                "L" : {"jong": ["ㄷ", "ㅌ", "ㄾ"]},
                "R" : {"cho" : ["ㅇ"], "joong" : ["ㅣ"]}
            },
            "process" : {
                "L" : {"jong" : [0, 0, "ㄹ"]},
                "R" : {"cho" : ["ㅈ","ㅊ","ㅊ"], "joong" : ["ㅣ"]*3}
            }
        }
    ],
    "rule_14_13_12_adv" : [
        {
            "condition": {
                "L":{"jong": ["ㄱ","ㄲ","ㄴ","ㄷ","ㄹ","ㅁ","ㅂ","ㅅ",
                              "ㅆ","ㅈ","ㅊ","ㅋ","ㅌ","ㅍ","ㄶ"]},
                "R":{"cho": ["ㅇ"], "joong": ["ㅣ"], "tag": ["MAG"]}
            },
            "process": {
                "L":{"jong": [0] * 15},
                "R":{"cho": ["ㄱ","ㄲ","ㄴ","ㄷ","ㄹ","ㅁ","ㅂ","ㅅ",
                             "ㅆ","ㅈ","ㅊ","ㅋ","ㅌ","ㅍ","ㄴ"]}
            }
        }
    ],
    "rule_14" : [
        {
            "condition": {
                "L": {"jong": ["ㄳ","ㄵ","ㄺ","ㄻ","ㄼ","ㄽ","ㄾ","ㄿ","ㅄ"]},
                "R": {
                    "cho": ["ㅇ"],
                    # "tag": FUNC_MORPHEME
                }
            },
            "process": {
                "L":{"jong":["ㄱ","ㄴ","ㄹ","ㄹ","ㄹ","ㄹ","ㄹ","ㄹ","ㅂ"]},
                "R":{"cho":["ㅆ","ㅈ","ㄱ","ㅁ","ㅂ","ㅆ","ㅌ","ㅍ","ㅆ"]}
            } 
        }
    ],
    "rule_13" : [
        {
            "condition": {
                "L":{"jong": ["ㄱ","ㄲ","ㄴ","ㄷ","ㄹ","ㅁ","ㅂ","ㅅ",
                              "ㅆ","ㅈ","ㅊ","ㅋ","ㅌ","ㅍ"]},
                "R":{"cho": ["ㅇ"], "tag": FUNC_MORPHEME}
            },
            "process": {
                "L":{"jong": [0] * 14},
                "R":{"cho": ["ㄱ","ㄲ","ㄴ","ㄷ","ㄹ","ㅁ","ㅂ","ㅅ",
                             "ㅆ","ㅈ","ㅊ","ㅋ","ㅌ","ㅍ"]}
            }
        }
    ],
    "rule_15" : [
        {
            "condition": {
                "L": {"jong": ["ㄱ","ㄲ","ㅋ","ㄳ","ㄺ","ㄷ","ㅅ","ㅆ",
                                "ㅈ","ㅊ","ㅌ","ㅂ","ㅍ","ㅄ","ㄿ",
                                "ㄴ","ㄵ","ㄹ","ㄼ","ㄽ","ㄾ","ㅁ","ㄻ"]},
                "R": {"cho": ["ㅇ"],
                    #  "joong": ["ㅏ", "ㅓ", "ㅗ", "ㅜ", "ㅟ", "ㅚ", "ㅐ", "ㅔ"],
                     "tag": LE_MORPHEME}
            },
            "process": {
                "L": {"jong": [0] * 13 + ["ㅂ"] + [0] * 9},
                "R": {"cho": ["ㄱ","ㄱ","ㄱ","ㄱ","ㄱ","ㄷ","ㄷ","ㄷ",
                                "ㄷ","ㄷ","ㄷ","ㅂ","ㅂ","ㅆ","ㅂ",
                                "ㄴ","ㄴ","ㄹ","ㄹ","ㄹ","ㄹ","ㅁ","ㅁ"]}
            }
        }
    ]
})

hieut_dict = OrderedDict({
    "rule_12_1" : [
        {
            "condition": {
                        "L" : {"jong": ["ㅈ"]},
                        "R" : {"cho" : ["ㅎ"], "tag" : ["EC", "VV"]}
            },
            "process" : {
                "L" : {"jong" : [0]},
                "R" : {"cho" : ["ㅊ"]}
            }
        },
        {
            "condition": {
                "L" : {"jong": ["ㄱ","ㄺ","ㄷ","ㅅ","ㅈ","ㅊ","ㅌ","ㅂ","ㄼ","ㄵ",
                                "ㄳ","ㄻ","ㄽ","ㄾ","ㄿ","ㅄ","ㄲ","ㅆ","ㅋ","ㅍ",]},  # 왼쪽 종성들은 ㅎ 앞에서 축약되지 않으므로(적어도 12항에는 안 나옴. 하지만 디자인의 문제) 중성화만 살린다.
                "R" : {"cho" : ["ㅎ"]}
            },
            "process" : {
                "L" : {"jong" : [0, "ㄹ", 0, 0, 0, 0, 0, 0, "ㄹ", "ㄴ",
                                "ㄱ", "ㅁ", "ㄹ", "ㄹ", "ㅂ", "ㅂ", "ㄱ", "ㄷ", "ㄱ", "ㅂ",]},
                "R" : {"cho" : ["ㅋ", "ㅋ", "ㅌ", "ㅌ", "ㅌ", "ㅌ", "ㅌ", "ㅍ", "ㅍ", "ㅊ",
                                "ㅎ", "ㅎ", "ㅎ", "ㅎ", "ㅎ", "ㅎ", "ㅎ", "ㅎ", "ㅎ", "ㅎ",]}
            }
        },
        {
            "condition": {
                "L":{"jong":["ㅎ", "ㄶ", "ㅀ"]},
                "R":{"cho": ["ㅇ", "ㅇ", "ㅇ"],}
                #"tag": FUNC_MORPHEME} 원래는 ㅎ, ㄶ, ㅀ 이 형식 형태소 앞에만 오지만 비문 대비를 위해 형태소 상관없이 모두 변환
            },
            "process": {
                "L":{"jong":[0, 0, 0]},
                "R":{"cho": ["ㅇ", "ㄴ", "ㄹ"]}
            }
        }
    ],
    "rule_12_2" : [
        {
            "condition": {
                "L":{"jong": ["ㅎ","ㄶ","ㅀ"]},
                "R":{"cho": ["ㄱ", "ㄷ", "ㅈ", "ㅅ", "ㄹ",]}
            },
            "process": {
                "L":{"jong": [0, "ㄴ", "ㄹ"]},
                "R":{"cho": ["ㅋ", "ㅌ", "ㅊ", "ㅆ", "ㄹ",]}
            }
        },
        {
            "condition": {
                "L":{"jong": ["ㅎ","ㄶ","ㅀ"]},
                "R":{"cho": ["ㄴ",]}
            },
            "process": {
                "L":{"jong": ["ㄴ", "ㄴ", "ㄹ"]},
                "R":{"cho": ["ㄴ",]}
            }
        },
        # ㅎ, ㄶ, ㅀ 뒤에 아래의 초성들은 오지 않지만 비문 대비용
        {
            "condition": {
                "L":{"jong": ["ㅎ","ㄶ","ㅀ"]},
                "R":{"cho": ["ㄲ", "ㄸ", "ㅁ", "ㅂ", "ㅃ", "ㅆ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"]}
            },
            "process": {
                "L":{"jong": [0, "ㄴ", "ㄹ"]},
                "R":{"cho": ["ㄲ", "ㄸ", "ㅁ", "ㅂ", "ㅃ", "ㅆ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"]}
            }
        },
    ]
})

rieul_nasalization_dict = OrderedDict({
    "rule_19" : [
        {
            "condition" : {
                "L" : {"jong" : ["ㅁ", "ㅂ", "ㅇ", "ㄱ"]},
                "R" : {"cho" : ["ㄹ"]}
            },
            "process" : {
                "L" : {"jong" : []},
                "R" : {"cho" : ["ㄴ"]}
            }
        }
    ]
})

jongseong_nasalization_dict = OrderedDict({
    "rule_18" : [
        {
            "condition": {
                        "L":{"jong": ["ㄱ"]},
                        "R":{"cho": ["ㄴ", "ㅁ"]}
            },
            "process": {
                "L":{"jong": ["ㅇ", "ㅇ"]},
                "R":{"cho": ["ㄴ", "ㅁ"]}
            }
        },
        {
            "condition": {
                "L":{"jong": ["ㅂ"]},
                "R":{"cho": ["ㄴ", "ㅁ"]}
            },
            "process": {
                "L":{"jong": ["ㅁ", "ㅁ"]},
                "R":{"cho": ["ㄴ", "ㅁ"]}
            }
        }
    ],
    "rule_18_30" : [
        {
            "condition": {
                        "L":{"jong": ["ㄷ"]},
                        "R":{"cho": ["ㄴ", "ㅁ"]}
            },
            "process": {
                "L":{"jong": ["ㄴ", "ㄴ"]},
                "R":{"cho": ["ㄴ", "ㅁ"]}
            }
        }
    ]
})

jongseong_validate_dict = OrderedDict({
    "rule_8" : [
        {
            "condition": {
                "L":{"jong": ["ㄲ", "ㅋ", "ㄳ", "ㄺ", "ㅅ", "ㅆ",
                              "ㅈ", "ㅊ", "ㅌ", "ㅎ", "ㅍ", "ㅄ",
                              "ㄿ", "ㄵ", "ㄶ", "ㄼ", "ㄽ", "ㄾ", "ㅀ","ㄻ"]},
                "R":{"cho": []}
            },
            "process": {
                "L":{"jong": ["ㄱ", "ㄱ", "ㄱ", "ㄱ", "ㄷ", "ㄷ",
                              "ㄷ", "ㄷ", "ㄷ", "ㄷ", "ㅂ", "ㅂ",
                              "ㅂ", "ㄴ", "ㄴ", "ㄹ", "ㄹ", "ㄹ", "ㄹ", "ㅁ"]},
                "R":{"cho": []}
            }
        }
    ]
})